import React, { useState, useEffect } from 'react'; 
import styles from './TextEffect.module.scss';


function TextEffect() {
  return (
    <div className="text">

二人は懐中電灯を手に、ゆっくりと洋館の暗がりの中を進んでいく。
床はひび割れ、壁紙は剥がれ落ち、時の流れがこの洋館を蝕んでいることがわかる。
この先に待ち受けるであろう怪奇現象との対決に備え、二人は絵画の前で意を決した...<br></br>
するとふと、遠くの部屋から物音がした。二人は顔を見合わせて眉を寄せる。
ここに他の人間がいるはずがない。<br></br>
「誰かいるのか?」きょろきょろと周囲を見回す。しかし答える者はいない。

そっと、物音のした方向へと忍び寄る。ドアの向こうには何があるのか。
恐る恐るドアノブに手をかけると、ビクッと反応する。まるで生きているようだ。<br></br>
      
ドアを開けると、中から冷たい風が吹き抜ける。中は埃と蜘蛛の巣だらけで真っ暗だ。
懐中電灯の光で部屋の奥を照らすと、そこには黒ずんだ聖母子の絵画が掛けられていた。<br></br>
絵の聖母マリアが、まるでこの部屋に入った二人を見下ろしているようにも感じられる。
これから待ち受けるであろう恐怖の予兆なのか。二人は背筋の寒さを覚えるのだった。<br></br>
    </div>
  );

}

export default TextEffect;




